import Image from "next/image";
import styles from "./Disease.module.scss";

import Image1 from "@/../public/image 21.png";
import Image2 from "@/../public/Frame 294.png";

export default function DiseaseBlock() {
  return (
    <section className={styles.root}>
      <div className={styles.top_block}>
        <div className={styles.text_block}>
          <h2>Остеопороз</h2>
          <p>
            Це хронічне захворювання, що характеризується зниженням щільності
            кісткової тканини і підвищенням ламкості кісток. Це робить кістки
            більш схильними до переломів навіть при незначних травмах або
            навантаженнях. Остеопороз часто розвивається без симптомів, доки не
            станеться перелом. Найбільш вразливими є хребет, стегнові кістки та
            зап’ястя.
          </p>
          <p>
            Фактори ризику включають вік, спадковість, недостатню фізичну
            активність, низький рівень кальцію і вітаміну D, куріння та вживання
            алкоголю. Жінки після менопаузи становлять основну групу ризику
            через гормональні зміни, які сприяють втраті кісткової маси.
          </p>
          <p>
            Остеопороз часто розвивається без симптомів, доки не станеться
            перелом. Найбільш вразливими є хребет, стегнові кістки та зап’ястя.
          </p>
        </div>
        <Image alt="Disease Block" src={Image1} width={900} height={600} />
      </div>
      <div className={styles.bottom_block}>
        <h2>Профілактика і лікування</h2>
        <p>
          Профілактика і лікування остеопорозу включають збалансоване харчування
          з достатньою кількістю кальцію і вітаміну D, регулярну фізичну
          активність, уникання шкідливих звичок, а також медикаментозну терапію
          за необхідності. Раннє виявлення та вжиття профілактичних заходів
          можуть значно знизити ризик серйозних ускладнень.
        </p>
        <Image alt="Disease Block 2" src={Image2} width={900} height={520} />
      </div>
    </section>
  );
}
